//자바의 자료형은 크게 '기본형'과 '참조형'으로 나눌 수 있다. (기본형은 설명 생략)
//참조형 변수는 기본형 변수와 달리 null 또는 객체의 주소를 값으로 갖는다.

public class ch2_변수_b_자료형 {
	public static void main(String[] args) {
		ch2_자료형 var=new ch2_자료형(); //참조형 변수 선언. 참조형 변수의 타입은 클래스의 이름이다.
		//new 연산자는 객체를 생성하며 생성된 객체의 주소를 리턴한다. 
		//이제 참조변수를 통해서 생성된 객체를 사용할 수 있게 된다.
		
		char c; //문자형 변수 선언. C와 달리 유니코드를 사용하므로 크기가 2byte이다.
		
		final int MAX_SPEED = 10; //상수는 변수와 달리 한번 값을 저장하면 다른 값으로 변경할 수 없다. final 키워드를 사용한다.
	
		float pi=3.14f; //리터럴이란? 이 문장에서 값 '3.14'이 리터럴.
		//리터럴에 접미사를 붙혀서 타입을 구분한다. long->l , float->f , double->d (정수형은 int, 실수형은 double이 각각 디폴트 자료형)
		//JDK1.7부터 정수형 리터럴의 중간에 구분자 '_'를 넣을 수 있다.
		
		String name1=new String(); //String 타입은 원래 클래스이므로 이렇게 사용해야 하지만,
		String name2="JAVA"; //이와 같은 표현도 허용된다.
		
		//덧셈 연산자 '+'는 피연산자가 모두 숫자일 때는 두 수를 더하지만, 어느 한 쪽이 String이면 나머지 한 쪽을 String으로 변환한 뒤 두 String을 결합한다.
		System.out.println(7+"7"); //7이 String으로 변환된 후 "7"+"7"이 수행되므로 "77"을 결과로 얻는다.
	}
}