/*
	생성자란?
	: 생성자는 인스턴스가 생성될 때 호출되는 초기화 메서드이다.
	따라서 인스턴스 변수의 초기화 작업에 주로 사용되며, 인스턴스 생성 시에 실행되어야 할 작업을 위해서도 사용한다.
	생성자 역시 메서드처럼 클래스 내에 선언되며, 구조도 메서드와 유사하지만 리턴값이 없다는 점이 다르다.
	
	생성자의 조건
	1) 생성자의 이름은 클래스의 이름과 같아야 한다.
	2) 생성자는 리턴값이 없다.
*/

class Card{
	Card(){
		
	}
	
	Card(int x){
		
	}
}//생성자 역시 오버로딩이 가능하다.


public class ch6_객체지향_j_생성자 {
	public static void main(String[] args) {
		Card c = new Card();
	}
}
/*
	new Card(); 문장이 수행되는 과정
	1) new 연산자에 의해서 메모리(heap)애 Card 클래스의 인스턴스가 생성된다. (new 연산자는 생성된 인스턴스의 주소를 반환한다.)
	2) 생성자 Card()가 호출되어 수행된다.
*/