/*
	[패키지]
	: 클래스의 묶음이며, 물리적으로 하나의 디렉터리이다.
	
	[패키지의 특징]
	: 서로 관련된 클래스들끼리 그룹 단위로 묶어 놓음으로써 클래스를 효율적으로 관리할 수 있다.
	또한 같은 이름의 클래스 일지라도 서로 다른 패키지에 존재하는 것이 가능하다.
	지금까지는 단순히 클래스 이름으로만 클래스를 구분했지만, 사실 클래스의 실제 이름은 패키지명을 포함한 것이다.
	(String 클래스의 실제 이름은 java.lang.String)
	
	[패키지 선언문]
	: 반드시 소스파일에서 첫 번째 문장이어야 하며, 하나의 소스파일에 단 한번만 선언될 수 있다.
	패키지명은 대소문자를 모두 허용하지만, 클래스명과 쉽게 구분하기 위해서 소문자로 하는 것을 원칙으로 하고 있다.
	
	[이름 없는 패키지]
	: 모든 클래스는 반드시 하나의 패키지에 포함되어야 한다고 했다.
	그럼에도 불구하고 지금까지 소스파일을 작성할 때 패키지를 선언하지 않고도 문제가 없었던 이유는 자바에서 기본적으로 제공하는 '이름 없는 패키지' 때문이다.
	소스파일에 자신이 속할 패키지를 정하지 않은 클래스들은 자동적으로 '이름 없는 패키지'에 속하게 된다.
*/

//package 패키지명;

public class ch7_객체지향_e_패키지 {
	public static void main(String[] args) {
		System.out.println("지금은 괜찮지만, 나중에 큰 프로젝트나 JAVA API와 같은 클래스 라이브러리를 작성하는 경우 패키지를 적절히 활용해야 한다!");
	}
}